import thumbnail from './../../assets/thumbnail.png'
import newsImage from './../../assets/news_image.png'

export default [
  {
    id: 0,
    title: '1成都市台办、台湾访问团莅临公司考察交流！',
    thumbnail,
    brief: '映射的基本原理以及流程如下：首先生成一个EOS主链钱包账户，获得一个私钥以及对应的公钥，然后构建一笔特殊的ETH交易，将上步生成的公钥与自己的ETH（含有EOS Token）地址绑定（即所谓映射）；',
    detail: `<p>
                5月14日下午，成都市政府台湾事务办公室以及台湾云林县青工会参访团赖嘉滨等一行人员来到宝妈环球购成都高新区办公地址进行参观访问，宝妈环球购CEO刘坚接待并与参访团一行人员举行会议。会议就宝妈环球购跨境电商相关工作事宜展开交流。
              </p>
              <img src="${newsImage}" alt="成都市台办、台湾访问团莅临公司考察交流！"/>
              <p>
                会议中，刘坚对参访团一行就宝妈环球购发展模式、自身优势以及未来发展规划进行了详细的阐述。他表示：宝妈环球购发展至今，在全国范围内已开设超700家新零售体验店，实体店以社区店为主，商场店为辅，每店都能展示上千款海外商品。而为了保证品牌的可持续发展，宝妈环球购每月都将淘汰及新增商品。
              </p>
              <p>
                对于宝妈环球购的蓬勃发展，刘坚表示：这与线上线下相结合的营销模式有着密切关系，宝妈环球购新零售体验店结合现有电商平台，实现消费者先现场体验、再线上购物的消费模式，打造出极佳的购物体验。除此之外，宝妈环球购健全的供应链体系，从品牌商直接采购到终端门店的商品展现，省去层层中间环节，为品牌在跨境电商行业的发展提供强大的竞争力。
              </p>
              <p>
                对于此次访问，台湾参访团团长赖嘉滨表示：宝妈环球购的新零售购物体验模式是大环境下的完美产物，未来必将呈爆发式发展。而台湾跨境电商新零售处于初具规模的发展中，希望在今后能与宝妈环球购进行商业方面的交流与合作，促进共同发展，也为进一步推进两岸关系作出一份努力。
              </p>
              <p>
                同时，台湾参访团将台湾名特产赠与宝妈环球购，以示双方友好，以及此次会议的圆满成功。
              </p>`,
    date: '06-01 12:00',
  },
  {
    id: 1,
    title: '2成都市台办、台湾访问团莅临公司考察交流！',
    thumbnail,
    brief: '映射的基本原理以及流程如下：首先生成一个EOS主链钱包账户，获得一个私钥以及对应的公钥，然后构建一笔特殊的ETH交易，将上步生成的公钥与自己的ETH（含有EOS Token）地址绑定（即所谓映射）；',
    detail: `<p>
                5月14日下午，成都市政府台湾事务办公室以及台湾云林县青工会参访团赖嘉滨等一行人员来到宝妈环球购成都高新区办公地址进行参观访问，宝妈环球购CEO刘坚接待并与参访团一行人员举行会议。会议就宝妈环球购跨境电商相关工作事宜展开交流。
              </p>
              <img src="${newsImage}" alt="成都市台办、台湾访问团莅临公司考察交流！"/>
              <p>
                会议中，刘坚对参访团一行就宝妈环球购发展模式、自身优势以及未来发展规划进行了详细的阐述。他表示：宝妈环球购发展至今，在全国范围内已开设超700家新零售体验店，实体店以社区店为主，商场店为辅，每店都能展示上千款海外商品。而为了保证品牌的可持续发展，宝妈环球购每月都将淘汰及新增商品。
              </p>
              <p>
                对于宝妈环球购的蓬勃发展，刘坚表示：这与线上线下相结合的营销模式有着密切关系，宝妈环球购新零售体验店结合现有电商平台，实现消费者先现场体验、再线上购物的消费模式，打造出极佳的购物体验。除此之外，宝妈环球购健全的供应链体系，从品牌商直接采购到终端门店的商品展现，省去层层中间环节，为品牌在跨境电商行业的发展提供强大的竞争力。
              </p>
              <p>
                对于此次访问，台湾参访团团长赖嘉滨表示：宝妈环球购的新零售购物体验模式是大环境下的完美产物，未来必将呈爆发式发展。而台湾跨境电商新零售处于初具规模的发展中，希望在今后能与宝妈环球购进行商业方面的交流与合作，促进共同发展，也为进一步推进两岸关系作出一份努力。
              </p>
              <p>
                同时，台湾参访团将台湾名特产赠与宝妈环球购，以示双方友好，以及此次会议的圆满成功。
              </p>`,
    date: '06-01 12:00',
  },
  {
    id: 2,
    title: '3成都市台办、台湾访问团莅临公司考察交流！',
    thumbnail,
    brief: '映射的基本原理以及流程如下：首先生成一个EOS主链钱包账户，获得一个私钥以及对应的公钥，然后构建一笔特殊的ETH交易，将上步生成的公钥与自己的ETH（含有EOS Token）地址绑定（即所谓映射）；',
    detail: `<p>
                5月14日下午，成都市政府台湾事务办公室以及台湾云林县青工会参访团赖嘉滨等一行人员来到宝妈环球购成都高新区办公地址进行参观访问，宝妈环球购CEO刘坚接待并与参访团一行人员举行会议。会议就宝妈环球购跨境电商相关工作事宜展开交流。
              </p>
              <img src="${newsImage}" alt="成都市台办、台湾访问团莅临公司考察交流！"/>
              <p>
                会议中，刘坚对参访团一行就宝妈环球购发展模式、自身优势以及未来发展规划进行了详细的阐述。他表示：宝妈环球购发展至今，在全国范围内已开设超700家新零售体验店，实体店以社区店为主，商场店为辅，每店都能展示上千款海外商品。而为了保证品牌的可持续发展，宝妈环球购每月都将淘汰及新增商品。
              </p>
              <p>
                对于宝妈环球购的蓬勃发展，刘坚表示：这与线上线下相结合的营销模式有着密切关系，宝妈环球购新零售体验店结合现有电商平台，实现消费者先现场体验、再线上购物的消费模式，打造出极佳的购物体验。除此之外，宝妈环球购健全的供应链体系，从品牌商直接采购到终端门店的商品展现，省去层层中间环节，为品牌在跨境电商行业的发展提供强大的竞争力。
              </p>
              <p>
                对于此次访问，台湾参访团团长赖嘉滨表示：宝妈环球购的新零售购物体验模式是大环境下的完美产物，未来必将呈爆发式发展。而台湾跨境电商新零售处于初具规模的发展中，希望在今后能与宝妈环球购进行商业方面的交流与合作，促进共同发展，也为进一步推进两岸关系作出一份努力。
              </p>
              <p>
                同时，台湾参访团将台湾名特产赠与宝妈环球购，以示双方友好，以及此次会议的圆满成功。
              </p>`,
    date: '06-01 12:00',
  },
]
