{
  "HELP": {
    "EXPLAIN": {
      "TITLE": "GAS助记词私钥",
      "ARTICLE_1": "What is the GAS fee?",
      "CONTENT_1": "On a public chain, anyone can read and write data. Reading data is free, but there is a cost to write data to the public chain. This overhead helps prevent spam and protects its security through payments. Any node on the network (each connection device containing a copy of the account is called a node) can participate in the protection of the network by means known as mining. Because mining requires computing power and electricity, the miners’ services need to be compensated. This is also the reason for the miner’s fees.The miners preferentially package gas with reasonable gas prices. If the miner’s fee paid when the user trades is very low, the transaction may not be packaged by the miner, resulting in a transaction failure.",
      "ARTICLE_2": "What is a mnemonic? The importance of mnemonics",
      "CONTENT_2": "The mnemonic is another form of expression of the plaintext private key, originally proposed by the BIP39 proposal. Its purpose is to help the user memorize complex private keys (64-bit hash values). The mnemonics are generally composed of 12, 15, 18, and 21 words. These words are taken from a fixed vocabulary. The generation order is also based on a certain algorithm. Therefore, the user does not need to worry about inputting 12 words casually to generate a word. address. The mnemonics can be used as another form of private key. It is an unencrypted private key. There is no security at all. Any person can get your mnemonic and can take away your assets effortlessly.Therefore, after the user has backed up the mnemonic, he must pay attention to three points: 1. Use physical media as much as possible to back up, for example, using a pen to copy on paper, etc., as far as possible not to use screenshots or photographs and place them in a networked device. Anti-hacked 2. Check the mnemonic of the backup for many times is correct. Once one or two words are misspelled, it will bring great difficulties to recover the correct mnemonic. 3. The mnemonics after backup Words are properly kept and anti-theft measures are to be taken.",
      "CONTENT_2_1": "PS: The user can use the backup mnemonics to re-import ONEX and use this method to modify the wallet password.",
      "ARTICLE_3": "什么是明文私钥? ",
      "CONTENT_3": "我们常说, 你对钱包中资金的控制取决于相应私钥的所有权和控制权。在区块链交易中, 私钥用于生成支付货币所必须的签名, 以证明资金的所有权。私钥必须始终保持机密, 因为一旦泄露给第三方, 相当于该私钥保护下的资产也拱手相让了。存储在用户钱包中的私钥完全独立, 可由用户的钱包软件生成并管理, 无需区块链或者网络连接。"
    },
    "AGREEMENT": {
      "TITLE": "ONEX Service Agreement",
      "SUB": "Updated on: May 15, 2018",
      "ARTICLE_1": "Respected user:",
      "CONTENT_1": "Thank you for choosing the ONEX service. \"ONEX Service Agreement\" (hereinafter referred to as \"this Agreement\") is signed by ONEX (hereinafter referred to as \"we\") and the user (hereinafter \"You\" or \"User\"), and this Agreement has a contractual law between you and ONEX. Effectiveness.ONEX hereby specifically reminds you to carefully read the “ONEX Service Agreement” and related agreements mentioned below before using ONEX (“ONEX” or “the Software”) to ensure that you fully understand the terms of this Agreement. And consider risks independently.",
      "ARTICLE_2": "I. Confirmation and acceptance of this agreement",
      "CONTENT_2_1": "1. You understand that this agreement and related agreements apply to ONEX.",
      "CONTENT_2_2": "2. By downloading the ONEX software and creating or importing the wallet, you are deemed to have fully read and accepted all the terms of this agreement. This agreement shall take effect immediately and shall be binding on both parties.",
      "CONTENT_2_3": "3. This agreement can be updated by ONEX at any time. Once the revised agreement is announced on ONEX, it will automatically become effective without further notice. After ONEX publishes the revised terms of the agreement, if you do not accept the revised terms, please stop using ONEX immediately. Your continued use of ONEX will be deemed as accepting the revised agreement.",
      "CONTENT_2_4": "4. If you are under the age of 18, or have no civil capacity or civil capacity restriction, please use ONEX under the guidance of your parent or guardian.",
      "ARTICLE_3": "II. the definition",
      "CONTENT_3_1": "1. ONEX: refers to the blockchain purses developed by ONEX based on multi-chain systems (and other blockchain systems that will be supported in the future), including other auxiliary tools developed to facilitate the use of blockchain systems by users.",
      "CONTENT_3_2": "2. Users:",
      "CONTENT_3_2_1": "(1) The user must be a natural person with full civil capacity;",
      "CONTENT_3_2_2": "(2) If you use ONEX services for minors under 18 years of age, you need to use ONEX under the guidance of your parent or guardian. The ONEX has the right to demand that you and your parent or guardian be responsible for all consequences of a transaction without a person with civil capacity who uses ONEX or restricts a civil capacity person to perform transactions beyond his civil rights or capacity.",
      "CONTENT_3_3": "3. Create or import a wallet: This is the process by which you use ONEX to confirm the performance of this agreement and create or import a wallet.",
      "CONTENT_3_4": "4. Wallet password: refers to the password that you are prompted to fill in during the process of creating an ONEX wallet. The password is used to encrypt and protect the private key. As a decentralized application, the wallet password is not stored on your mobile device or ONEX server. Once lost, you need to reset the new password using the plaintext private key or mnemonic.",
      "CONTENT_3_5": "5. Information prompt: The information hints involved in the ONEX software operation interface suggest that the user follow the related steps.",
      "CONTENT_3_6": "6. Specific users: Refers to users who have to cooperate with ONEX to perform their personal information disclosure obligations in accordance with Chinese laws and regulations and policies.",
      "CONTENT_3_7": "7. Private key: Constitutes 256 random characters, which is the core of the user owns and uses digital tokens.",
      "CONTENT_3_8": "8. Public key: The private key is generated by unidirectional derivation through cryptographic principles and is used to generate a blockchain digital wallet address. The digital wallet address is the public payment address.",
      "CONTENT_3_9": "9. Mnemative: Comply with the blockchain BIP39 industry standard, consisting of 12 (or 15/18/21/24) ordered words generated by a random algorithm. It is an easy-to-record form of private key, which is convenient for user backup and storage.",
      "CONTENT_3_10": "10. Digital tokens: Refers to the types of digital tokens currently supported by ONEX, including but not limited to ETH, BTC, DGD, etc.",
      "CONTENT_3_11": "11. Information: Refers to articles such as “Browse”, “Market”, etc. on the ONEX. These materials are owned by ONEX and may not be reproduced without authorization.",
      "CONTENT_3_12": "12. Personal Information: means information recorded in electronic or other ways that can be used alone or in combination with other information to identify a user's personal identity, including but not limited to the name, date of birth, identity card number, personal biometric information, and address of a natural person. , phone number, bank card number, email address, wallet address, mobile device information, operation records, transaction records, etc., but does not include the user's wallet password, private key, mnemonic.",
      "ARTICLE_4": "III. the service content",
      "CONTENT_4_1": "1. Create or import wallets. For ONEX-supported digital tokens, you can use ONEX to generate a new wallet or import a compatible wallet generated by other wallet tools of the relevant blockchain system.",
      "CONTENT_4_2": "2. Transfers and collections. You can use ONEX's transfer and collection functions to manage digital tokens. That is, you use a private key to electronically sign and modify the related blockchain's ledger. Transfer refers to that the payer uses the recipient's blockchain address to perform the transfer operation. The actual transfer and collection behavior occurs in the relevant blockchain system (not ONEX).",
      "CONTENT_4_3": "3. Manage digital assets. You can use ONEX to add, keep, and remove digital tokens that ONEX supports.",
      "CONTENT_4_4": "4. Transaction history. We will copy all or part of your transaction records through the blockchain system. However, the transaction records are based on the blockchain system records.",
      "CONTENT_4_5": "5. Suspend service. You know that based on the \"irrevocable\" nature of blockchain systemtransactions, we cannot suspend or revoke transfer transactions, but under certain circumstances, we can suspend or limit the operation of one user on ONEX software.",
      "CONTENT_4_6": "6. Other services that ONEX considers necessary.",
      "ARTICLE_5": "When users accept the above services provided by ONEX, they should understand the following common problems:",
      "CONTENT_5_1": "1. Upholding the decentralized nature of the blockchain, and in order to protect the security of users' digital tokens, ONEX provides decentralized services that are significantly different from banking financial institutions. Users understand that ONEX does not provide the following services:",
      "CONTENT_5_1_1": "(1) Store the user's wallet password (that is, the password set when the user creates/imports the wallet), private key, and mnemonic;",
      "CONTENT_5_1_2": "(2) retrieve the user's wallet password, private key, mnemonic;",
      "CONTENT_5_1_3": "(3) to freeze the wallet;",
      "CONTENT_5_1_4": "(4) Lost wallet;",
      "CONTENT_5_1_5": "(5) restore wallet;",
      "CONTENT_5_1_6": "(6) The transaction was rolled back.",
      "CONTENT_5_2": "2. Since ONEX does not provide the above services, users should take care of mobile devices containing ONEX, back up ONEX, backup wallet passwords, mnemonics, and private keys. If the user loses the mobile device, deletes and does not back up the ONEX, deletes and does not back up the wallet, the wallet is stolen or the wallet password, private key, mnemonic are forgotten, ONEX cannot restore the wallet or retrieve the wallet password, private key, mnemonic If the user mis-operates during a transaction (such as entering the wrong transfer address), ONEX cannot cancel the transaction.",
      "CONTENT_5_3": "3. The digital token management services that ONEX and ONEX can provide do not include all existing digital tokens. Do not use ONEX to operate any digital tokens that ONEX does not support.",
      "CONTENT_5_4": "4. ONEX is only a user's digital token management tool, not an exchange or trading platform. Although this agreement will refer to \"transactions\" several times, its behavior generally refers to the transfer and collection operations performed by users using ONEX, which is essentially different from the \"transactions\" conducted on exchanges or trading platforms.",
      "ARTICLE_6": "IV. your rights and obligations",
      "CONTENT_6_1": "(a) Create or Import Wallet",
      "CONTENT_6_1_1": "1. Create or import wallets: You have the right to create and/or import wallets on your mobile device via ONEX, have the right to set wallet wallet passwords and other information, and have access to ONEX applications, using your wallet in the district Transfers and collections and other transactions are carried out on the block chain.",
      "CONTENT_6_1_2": "2. Authentication: In accordance with the relevant laws, regulations and policies, specific users should complete the relevant authentication in accordance with the ONIX prompts when using the relevant services provided by ONEX, and require you to submit including but not limited to your name, ID number, Personal information such as mobile phone number and bank card number information. Otherwise, the specific user will not be able to use the service. The loss caused by the delay of the specific user will be borne by you.",
      "CONTENT_6_1_3": "3. ONEX may develop different software versions for different terminal devices. You should select the appropriate version to install according to your actual needs. If you obtain this software from an unauthorised third party or an installer with the same name as the software, ONEX cannot guarantee the normal use of the software or guarantee its security. Therefore, you are responsible for the losses incurred.",
      "CONTENT_6_1_4": "4. After the new version of the software is released, the old software may not be available. ONEX does not guarantee the security, continued availability, and provision of appropriate customer services for legacy software. Please check and download the latest version at any time.",
      "CONTENT_6_2": "(b) Use",
      "CONTENT_6_2_1": "1. Users should keep their mobile devices, wallet passwords, private keys, mnemonics, and other information. ONEX is not responsible for keeping the above information for users. All risks, liabilities, losses, and costs arising from your loss of mobile devices, active or passive disclosure, forgotten wallet passwords, private keys, mnemonics, or other attacks, frauds, etc., shall be your sole responsibility.",
      "CONTENT_6_2_2": "2. Follow the information prompts. You understand and agree to follow the information that ONEX makes to you and follow the information provided. Otherwise, all risks, liabilities, losses, costs, etc. arising from this shall be borne by you.",
      "CONTENT_6_2_3": "3. Actively complete the authentication. When ONIX reasonably thinks that your trading behavior or trading situation is abnormal, or believes that your identity information is suspicious, or if ONEX believes that you should check your ID card or other necessary documents, please actively cooperate with ONEX to verify your validity. Identity documents or other necessary documents to complete the relevant authentication in a timely manner.",
      "CONTENT_6_2_4": "4. Transfer money.",
      "CONTENT_6_2_4_1": "(1) You are aware of the daily transfer limit and the number of transactions that you can use for ONEX services, possibly because of the country in which you used the transfer service, regulatory requirements, transfer purposes, ONEX risk control, authentication, etc. And different.",
      "CONTENT_6_2_4_2": "(2) You understand the \"irrevocability\" attribute based on the blockchain operation. When you use the ONEX transfer function, you should bear the consequences of your misoperation (including but not limited to the wrong transfer address, you Question of choosing the transfer node server itself).",
      "CONTENT_6_2_4_3": "(3) You understand that when using the ONEX service, the following conditions may cause the transaction \"transaction failure\" or \"packaging timeout\":",
      "CONTENT_6_2_4_3_1": "a) insufficient wallet balance;",
      "CONTENT_6_2_4_3_2": "b) Insufficient trading miner fees;",
      "CONTENT_6_2_4_3_3": "c) The blockchain execution contract code failed;",
      "CONTENT_6_2_4_3_4": "d) exceed the amount of payment required by the regulatory authority, ONEX, or laws and regulations;",
      "CONTENT_6_2_4_3_5": "e) Technical failures such as network and equipment;",
      "CONTENT_6_2_4_3_6": "f) Blocked network congestion, failures and other reasons caused the transaction to be abandoned;",
      "CONTENT_6_2_4_3_7": "g) Your address or counterparty address is identified as a special address, such as a high-risk address, exchange address, ICO address, Token address, etc.",
      "CONTENT_6_2_4_4": "(4) You understand that ONEX only provides you with transfer tools. After you use ONEX to complete the transfer, ONEX completes all the obligations of the service. ONEX disputes other disputes and does not bear any obligations.",
      "CONTENT_6_2_5": "5. Legal compliance. You understand that when operating at ONEX, you should follow the requirements of relevant laws and regulations and national policies.",
      "CONTENT_6_2_6": "6. Notice of announcement. ONEX will send notices to you via web site announcements, emails, text messages, telephone calls, message center messages, pop-up reminders, or client notifications, for example, to inform you of the progress of the transaction or to prompt you for related operations. Please promptly attention.",
      "CONTENT_6_2_7": "7. Service Fees and Taxes:",
      "CONTENT_6_2_7_1": "(1) ONEX does not charge you any kind of service fees or fees for the time being. In the future, if you need to charge certain services, you will be required to stipulate or publish rules;",
      "CONTENT_6_2_7_2": "(2) When you use ONEX to make a transfer, you should pay the miner's fee at the discretion of you. Miner’s fees are charged by the relevant blockchain system;",
      "CONTENT_6_2_7_3": "(3) You are aware that under certain circumstances, because your environment and network status are not stable and your transfer operation is not completed, the relevant blockchain system will also collect miner's fees;",
      "CONTENT_6_2_7_4": "(4) You are responsible for the payment of all taxable and other expenses incurred by you for trading on ONEX.",
      "ARTICLE_7": "V. Risk Warning",
      "CONTENT_7_1": "1. You understand and understand that due to the fact that laws and regulations in the field of digital tokens are not yet sound, digital tokens in this area may have major risks such as unfulfilled funds and technical instability. And the price fluctuation of digital tokens is much higher than other financial assets. We caution you that you should rationally choose to hold or dispose of any type of digital token based on your financial situation and your risk appetite.",
      "CONTENT_7_2": "2. In the use of ONEX services, if you or your counterparties fail to comply with this agreement or related website instructions, transactions, payment tips, rules, ONEX does not guarantee that the transaction will be successfully completed, and ONEX does not bear the damages responsibility. In the event of the foregoing, and the payment has been credited to your or your counterparty's ONEX wallet or third-party wallet, you understand that the blockchain operation has the \"irreversible\" attribute and that the relevant transaction has \"irreversible\" features. You and your counterparty bear the corresponding risk consequences.",
      "CONTENT_7_3": "3. In the process of trading, you should judge whether the other party is a fully civil capacity person and decide whether to deal with the other party or transfer it to the other party, etc. You should bear all risks associated with this.",
      "CONTENT_7_4": "4. During the transfer process, if there are similar abnormal information prompts such as \"transaction failure\", \"packaging timeout\", etc., you should confirm again through the official channel of the relevant blockchain system or other blockchain query tools. Avoid duplicate transfers; otherwise, all losses and costs incurred by you should be your responsibility.",
      "CONTENT_7_5": "5. You understand that when you create or import a wallet on ONEX, your private key, mnemonic, and other information is only stored on the current mobile device and not on the ONEX or ONEX server. You can replace the mobile device with a synchronized wallet, etc. according to the operation guide provided by ONEX. However, if you do not save or backup wallet passwords, private keys, mnemonics, etc. and your mobile device is lost, your digital tokens will be lost and ONEX will not be able to retrieve them for you. . Your digital tokens will be lost if you disclose, save, or back up wallet passwords, private keys, mnemonics, etc., or if the device or server that saves or backs up the information is hacked or controlled. ,ONEX can't find it for you, you need to bear the loss.",
      "CONTENT_7_6": "6. We recommend that you make a secure backup of your wallet wallet password, private key, mnemonic, etc. when creating or importing your wallet. We draw your attention, please do not use the following backup methods: screenshots, e-mail, notepad, SMS, WeChat, QQ and other electronic backup methods. We recommend that you copy information such as mnemonics on paper notebooks, and that you can also save electronic data to the password manager.",
      "CONTENT_7_7": "7. We recommend that you use ONEX in a secure network environment to ensure that your mobile device is not jailbroken or rooted to avoid potential security risks",
      "CONTENT_7_8": "8. In the process of using our services, please be alert to non-ONEX official fraud. Once such behavior is discovered, we encourage you to inform us as soon as possible.",
      "ARTICLE_8": "VI. service changes, interruptions, termination",
      "CONTENT_8_1": "1. You agree that ONEX may temporarily provide certain service functions to ensure the right to operate its own business, or suspend some service functions or open new service functions in the future. When any function is reduced or increased or changed, as long as you still use the services provided by ONEX, you still agree to this agreement or the amended terms of this agreement.",
      "CONTENT_8_2": "2. You understand that ONEX will suspend the provision of services if:",
      "CONTENT_8_2_1": "(1) Business interruption due to technical reasons such as equipment, blockchain system maintenance, upgrades, failures, and communication interruptions;",
      "CONTENT_8_2_2": "(2) Forced factors such as typhoons, earthquakes, tsunamis, floods, power outages, wars or terrorist attacks, viruses, Trojans, hacker attacks, system instability or government actions, etc., which caused the ONEX system to fail to provide services or ONIX reasonably believes that it will continue to provide Service will be more risky;",
      "CONTENT_8_2_3": "(3) There are other circumstances where ONEX cannot control or reasonably foresee.",
      "CONTENT_8_3": "3. ONEX may unilaterally suspend or terminate your use of some or all of the features of ONEX when you:",
      "CONTENT_8_3_1": "(1) Death of the user;",
      "CONTENT_8_3_2": "(2) misappropriation of other people's wallet information or mobile devices;",
      "CONTENT_8_3_3": "(3) Providing false information when filling out personal information, and not performing it when answering the questionnaire for ability assessment;",
      "CONTENT_8_3_4": "(4) Deny the mandatory update operations initiated by ONEX to enhance the ONEX function;",
      "CONTENT_8_3_5": "(5) Use ONEX for illegal or criminal activities;",
      "CONTENT_8_3_6": "(6) Prevent other users from using it normally;",
      "CONTENT_8_3_7": "(7) Workers or managers falsely called ONEX;",
      "CONTENT_8_3_8": "(8) Attacks, invades, changes or threatens the normal operation of the ONEX computer system in any other way;",
      "CONTENT_8_3_9": "(9) Using ONEX to promote spam advertisements;",
      "CONTENT_8_3_10": "(10) Spread rumors, damage ONEX and ONEX goodwill;",
      "CONTENT_8_3_11": "(11) Illegal acts, other violations of this agreement, and circumstances where ONEX reasonably believes that the function should be suspended.",
      "CONTENT_8_4": "4. When the service relationship between you and ONEX is changed, interrupted or terminated, you still have the right to export your wallet and other information within a reasonable time.",
      "ARTICLE_9": "VII. Promise of Your Legal Use of ONEX Services",
      "CONTENT_9_1": "1. You must abide by the laws and regulations of the country or region where you live. You may not use ONEX for any unlawful purpose or use the ONEX service in any illegal way.",
      "CONTENT_9_2": "2. You may not use ONEX to engage in illegal or criminal activities, including but not limited to:",
      "CONTENT_9_2_1": "(1) Oppose the basic principles set by the Constitution, endanger national security, leak state secrets, subvert state power, and undermine national unity;",
      "CONTENT_9_2_2": "(2) engage in any illegal and criminal activities, including but not limited to money laundering, illegal fund-raising, etc.;",
      "CONTENT_9_2_3": "(3) By using any automated program, software, engine, web crawler, web analytics tool, data mining tool or similar tool to access ONEX services, collect or process the content provided by ONEX, intervene or attempt to interfere with any user or any other Access to ONEX services in a manner;",
      "CONTENT_9_2_4": "(4) Providing gambling information or inducing others to participate in gambling in any way;",
      "CONTENT_9_2_5": "(5) Intruding on another ONEX wallet to steal digital tokens;",
      "CONTENT_9_2_6": "(6) Conduct transactions that are inconsistent with the transaction content declared by the counterparty, or unreal transactions;",
      "CONTENT_9_2_7": "(7) Engaging in any infringement or possible infringement of the ONEX service system or data;",
      "CONTENT_9_2_8": "(8) Other violations and actions that ONEX believes are inappropriate.",
      "CONTENT_9_3": "3. You understand and agree that if you violate any law (including but not limited to customs and tax regulatory requirements) or the provisions of this agreement, make ONEX suffer any loss, be subject to any third party’s claim or any administrative department Penalty, you should compensate ONEX for compensation, including reasonable attorneys' fees.",
      "CONTENT_9_4": "4. You promise to pay ONEX service fees (if any) on time, otherwise ONEX has the right to suspend or suspend services provided to you.",
      "ARTICLE_10": "VIII. Privacy Policy",
      "CONTENT_10_1": "ONEX attaches great importance to the protection of user privacy. For related privacy protection policies, please refer to ONEX's Privacy Policy, which is updated from time to time by ONEX.",
      "ARTICLE_11": "IX. Exemption and limitation of liability",
      "CONTENT_11_1": "1. ONEX is only liable for the obligations listed in this agreement.",
      "CONTENT_11_2": "2. You understand and agree that, to the extent permitted by law, ONEX can only provide services in accordance with the current state of technology and conditions. The ONEX does not assume responsibility for the following reasons:",
      "CONTENT_11_2_1": "(1) ONEX system shutdown maintenance or upgrade;",
      "CONTENT_11_2_2": "(2) Force majeure reasons such as typhoon, earthquake, flood, lightning, or terrorist attack;",
      "CONTENT_11_2_3": "(3) Your mobile device hardware and software and communication lines, power lines have failed;",
      "CONTENT_11_2_4": "(4) You use the ONEX service improperly or not authorized or authorized by ONEX;",
      "CONTENT_11_2_5": "(5) due to viruses, Trojan horses, malicious program attacks, network congestion, system instability, system or equipment failures, communications failures, power failures, bank or other reasons or government actions and other reasons;",
      "CONTENT_11_2_6": "(6) Any other reason not caused by ONEX.",
      "CONTENT_11_3": "3. ONEX is not responsible for the following situations:",
      "CONTENT_11_3_1": "(1) Loss of digital tokens caused by the user's loss of mobile devices, deletion and non-backup of ONEX, deletion and non-backup of wallets, stolen wallets or forgotten wallet passwords, private keys, mnemonics;",
      "CONTENT_11_3_2": "(2) Use of your wallet code, private key, mnemonic, or borrowing, transferring or authorizing others to use your mobile device or ONEX wallet, or failing to download ONEX applications or other unsafe ways through the ONIX official channel Loss of digital tokens due to ONEX applications;",
      "CONTENT_11_3_3": "(3) Loss of digital token due to user misoperation (including, but not limited to, your input of wrong transfer address, your own choice of transfer node server);",
      "CONTENT_11_3_4": "(4) Loss of digital tokens due to misoperation caused by users who do not understand the nature of blockchain technology;",
      "CONTENT_11_3_5": "(5) The transaction records of ONEX copying users in the blockchain are deviated due to time lags and instability of the blockchain system.",
      "CONTENT_11_4": "4. ONEX may provide services to you and your counterparties at the same time. You agree to explicitly waive any actual or potential conflicts of interest in the possible existence of ONEX, and do not assert that ONEX exists in providing services. The blasphemy does not add to ONEX's responsibilities or due diligence.",
      "CONTENT_11_5": "5. ONEX does not provide the following forms of assurance:",
      "CONTENT_11_5_1": "(1) ONEX services will meet all your needs;",
      "CONTENT_11_5_2": "(2) Any technology, product, service, information you obtain via ONEX services will meet your expectations;",
      "CONTENT_11_5_3": "(3) ONEX guarantees the timeliness, accuracy, completeness and reliability of the transaction information of the digital token market captured by the third-party exchange;",
      "CONTENT_11_5_4": "(4) Each party to your transaction on ONEX will fulfill its obligations in the transaction agreement with you in a timely manner.",
      "CONTENT_11_6": "6. In any case, the total amount of liability for damages incurred by ONEX on this agreement does not exceed 1) 0.1 Ethereum; or 2) RMB 500, whichever is higher.",
      "CONTENT_11_7": "7. You understand that ONEX is only a tool for users to manage digital tokens and display transaction information. ONEX does not provide legal, tax or investment advice services. You should seek advice from professionals in law, taxation, and investment, and ONEX will not be responsible for any investment loss, data loss, etc. that you suffer in using our services.",
      "CONTENT_11_8": "8. You understand that according to the requirements of relevant Chinese policies and regulations, we may change our user access standards from time to time, limiting the scope and manner of providing services to a particular group.",
      "ARTICLE_12": "X. complete agreement",
      "CONTENT_12_1": "1. This Agreement consists of the \"ONEX Service Agreement\", \"ONEX Privacy Policy\" and the rules (including the \"Help Center\") published by ONEX from time to time.",
      "CONTENT_12_2": "2. Some of the contents of this agreement are deemed to be infringed or invalid by a court with jurisdiction, and therefore do not affect the validity of other contents.",
      "CONTENT_12_3": "3. Any translation version of this Agreement is provided for the convenience of the user only and is not intended to modify the terms of this Agreement. If there is a conflict between the Chinese version and the non-Chinese version of this agreement, the Chinese version shall prevail.",
      "ARTICLE_13": "XI. Intellectual Property Protection",
      "CONTENT_13_1": "ONEX is an application that owns intellectual property. The intellectual property of any content (including this agreement, announcement, article, video, audio, picture, file, information, data, trademark or logo) displayed in ONEX shall be owned by ONEX or the owner of the third party. Users can only use the ONEX application and its contents for the purpose of holding and managing digital tokens. No one shall use, modify, reverse-compile, copy, publicly transmit, alter, distribute, publish, or publish the aforementioned applications and content without the prior written consent of ONEX or the third-party rights holder.",
      "ARTICLE_14": "XII. Application of Law and Dispute Resolution",
      "CONTENT_14_1": "1. The validity, interpretation, modification, execution and dispute resolution of this Agreement and its revisions shall be governed by the laws of the People's Republic of China. If there is no relevant law, international business practices and/or industry practices shall apply.",
      "CONTENT_14_2": "2. If there is any dispute or dispute between you and ONEX, it should first be settled through friendly negotiation. If the negotiation fails, either party may submit the jurisdiction of People’s Court with the jurisdiction of ONEX.",
      "ARTICLE_15": "XIII. Others",
      "CONTENT_15_1": "1. You need to fully understand and comply with all relevant laws, regulations and rules in your jurisdiction and the use of ONEX services.",
      "CONTENT_15_2": "2. If you have any problems during the use of the ONEX service, you can contact us by submitting feedback on ONEX.",
      "CONTENT_15_3": "3. You can view this agreement in ONEX. ONEX encourages you to review ONEX's service agreement every time you visit ONEX.",
      "CONTENT_15_4": "4. This Agreement shall apply as of May 15, 2018.",
      "BOTTOM": "For matters not covered by this agreement, you are required to comply with the announcement and relevant rules of the ONIX update from time to time."
    },
    "PRIVACY": {
      "TITLE": "ONEX Privacy Policy",
      "SUB": "Updated on: May 15, 2018",
      "ARTICLE_1": "respected user: ",
      "CONTENT_1_1": "ONEX (“ONEX” or “We”) respects and protects the privacy of users (“you” or “Users”), and when you use ONEX, ONEX will collect them in accordance with this Privacy Policy (hereinafter referred to as “this Policy”). Use your personal information.",
      "CONTENT_1_2": "ONEX recommends that you carefully read and understand the entire contents of this Policy before using this product (“ONEX”), and that important information including terms such as disclaimers will be displayed in bold. The definitions of keywords in this policy are consistent with the ONEX “ONEX Service Agreement.”",
      "CONTENT_1_3": "This policy can be updated by ONEX Online at any time. Once the updated policy is announced, it replaces the original policy. If you do not accept the revised terms, please stop using ONEX immediately. Your continued use of ONEX will be deemed as accepting the revised policy. Once the revised policy is announced on ONEX, it will automatically become effective.",
      "CONTENT_1_4": "You understand that this policy and other related regulations apply to ONEX.",
      "ARTICLE_2": "First, what information do we collect from you?",
      "CONTENT_2": "Please understand that we have collected the following information for you to meet your needs in the ONEX service, and we attach great importance to protecting your privacy. When we collect your information, we will strictly abide by the principles of “legitimate, proper, and necessary”. And you understand that if you do not provide the relevant information required by our services, your experience in ONEX may be affected.",
      "CONTENT_2_1": "1. We will collect personal information such as your mobile device information, operation records, transaction records, and wallet address.",
      "CONTENT_2_2": "2. To meet your specific service needs, we will collect your name, bank card number, mobile phone number, email address and other information.",
      "CONTENT_2_3": "3. You are aware that your wallet password, private key, mnemonics on the ONEX are not stored or synchronized to the ONEX server. ONEX does not provide services to retrieve your wallet password, private key, mnemonic.",
      "CONTENT_2_4": "4. In addition to the above, you understand that when you use ONEX-specific features, we will make special prompts to collect more personal information from you before collecting your personal information. If you choose to disagree, you are deemed to have given up using ONEX for this particular feature.",
      "CONTENT_2_5": "5. To the extent permitted by laws and regulations, ONEX may collect and use your personal information in the following situations without your permission:",
      "CONTENT_2_5_1": "(1) Related to national security and national defense security;",
      "CONTENT_2_5_2": "(2) related to public safety, public health, and major public interests;",
      "CONTENT_2_5_3": "(3) Related to criminal investigation, prosecution, trial and execution of judgment;",
      "CONTENT_2_5_4": "(4) The personal information collected is your own disclosure to the public;",
      "CONTENT_2_5_5": "(5) Gather your personal information from legally disclosed information, such as legitimate news reports, government information disclosure, etc.;",
      "CONTENT_2_5_6": "(6) Required for the security and compliance of maintenance services, such as the discovery, handling of product and service failures;",
      "CONTENT_2_5_7": "(7) Other circumstances stipulated by laws and regulations.",
      "CONTENT_2_6": "6. The way we collect information is as follows:",
      "CONTENT_2_6_1": "(1) You provide us with information. For example, you fill in the name, mobile number, or bank card number in the “Personal Center” page, or provide an e-mail address in response to a question, or you may provide us with additional information when using our specific services.",
      "CONTENT_2_6_2": "(2) We obtain information during your use of ONEX, including information on your mobile device and your operation records on ONEX;",
      "CONTENT_2_6_3": "(3) We copy all or part of your transaction records through the blockchain system. However, the transaction records are based on the blockchain system records.",
      "ARTICLE_3": "Second, how we use your information",
      "CONTENT_3_1": "1. We confirm your correspondence with your wallet through your mobile device's unique serial number.",
      "CONTENT_3_2": "2. We will promptly send you important notices such as software updates, service agreements, and changes to the terms of this policy.",
      "CONTENT_3_3": "3. We provide you with the “Fingerprint Login” option in the “System Settings” of ONEX, allowing you to conveniently and securely manage your digital tokens.",
      "CONTENT_3_4": "4. We process the feedback you submitted to us by collecting your public wallet address and provided mobile device information.",
      "CONTENT_3_5": "5. We collect your personal information for ONEX internal audit, data analysis and research, etc. in order to continuously improve our service level.",
      "CONTENT_3_6": "6. In accordance with the “ONEX Service Agreement” and other relevant regulations of ONEX, ONEX will use user information to manage and handle the use of users.",
      "CONTENT_3_7": "7. The requirements of laws and regulations and coordination with regulatory agencies.",
      "ARTICLE_4": "Third, how do you control your own information",
      "CONTENT_4": "You have the following autonomous control over your personal information in ONEX:",
      "CONTENT_4_1": "1. You can import your other wallets into ONEX by synchronizing your wallet, or import your wallet in ONEX into other digital token management wallets. ONEX will show you the information of the import wallet.",
      "CONTENT_4_2": "2. You are aware that you can modify your digital token types, make transfers, and collect payments through the contents of the “Assets” section.",
      "CONTENT_4_3": "3. You know that in the ONEX “I” section you are free to choose the following:",
      "CONTENT_4_3_1": "(1) In “Contacts”, you can view and modify your “Contacts” at any time;",
      "CONTENT_4_3_2": "(2) In the “System Settings”, you can choose not to open the “Fingerprint Login” option, that is, you can choose not to use the Touch ID verification service provided by Apple;",
      "CONTENT_4_3_3": "(3) In the “Personal Center”, you do not need to provide your own name, mobile number, bank card and other information, but when you use a specific service, you need to provide the above information;",
      "CONTENT_4_3_4": "(4) In the “Submitting Feedback”, you can at any time ask us your questions and suggestions for improvement on the ONEX. We will be very happy to communicate with you and actively improve our services.",
      "CONTENT_4_4": "4. You understand that when we collect information from you for a specific purpose, we will give you notice in advance and you have the right to refuse. However, at the same time, you are aware that when you choose to refuse to provide relevant information, you indicate that you have waived the use of ONEX services.",
      "CONTENT_4_5": "5. You are aware that you and we have no control over whether your transaction records are disclosed, because your transaction records are open and transparent throughout the blockchain system based on the open source nature of the blockchain trading system.",
      "CONTENT_4_6": "6. You have the right to ask us to update, change or delete your relevant information.",
      "CONTENT_4_7": "7. You are aware that we may collect your information in accordance with paragraph 1 of Article 1 of this Policy without obtaining your consent.",
      "ARTICLE_5": "Fourth, we may share or transmit your information",
      "CONTENT_5_1": "1. ONEX does not share or transfer your personal information to any third party without your prior consent, except:",
      "CONTENT_5_1_1": "(1) Obtain your explicit consent or authorization in advance;",
      "CONTENT_5_1_2": "(2) The personal information collected is your own disclosure to the public;",
      "CONTENT_5_1_3": "(3) Collected personal information is collected from legally disclosed information, such as legitimate news reports, government information disclosure, etc.;",
      "CONTENT_5_1_4": "(4) To share with ONEX's affiliates, we will only share the necessary user information and be bound by the purposes stated in this Privacy Policy;",
      "CONTENT_5_1_5": "(5) Provided in accordance with applicable laws and regulations, requirements of legal procedures, requirements of administrative agencies or judicial agencies;",
      "CONTENT_5_1_6": "(6) When it comes to mergers and acquisitions, ONEX will require the recipient of personal information to continue accepting this policy if it involves the transfer of personal information.",
      "ARTICLE_6": "Fifth. How we protect your information",
      "CONTENT_6_1": "1. If ONEX ceases to operate, ONEX will cease the collection of your personal information activities in a timely manner, notify the announcement of the suspension of operations on ONEX, and delete or anonymize your personal information held within a reasonable period of time.",
      "CONTENT_6_2": "2. To protect your personal information, ONEX will adopt data security technology measures to enhance internal compliance, increase internal employee information security training, and securely protect your private information by setting security access rights to relevant data.",
      "CONTENT_6_3": "3. We will send you information on information security in the ONEX “Message Center”. From time to time, information on wallet usage and information protection will be updated in the ONEX “Help Center” section for your reference.",
      "ARTICLE_7": "Sixth, the protection of minors",
      "CONTENT_7": "We make the following special arrangements for the protection of minors under the age of 18:",
      "CONTENT_7_1": "1. Minors should use the ONEX related services under the guidance of a parent or guardian.",
      "CONTENT_7_2": "2. We recommend that parents and guardians of minors should guide minors to use ONEX while reading this policy, the ONEX Service Agreement and our other relevant rules.",
      "CONTENT_7_3": "3. ONEX will protect the confidentiality and security of minors' personal information in accordance with the relevant national laws and regulations.",
      "ARTICLE_8": "Seventh. Disclaimer",
      "CONTENT_8": "ONEX will use reasonable security measures to protect your personal information as far as possible in the state of the art to prevent the disclosure, alteration or destruction of information. ONEX uses wireless to transmit data. Therefore, ONEX cannot guarantee the privacy and security of data transmitted over wireless networks.",
      "ARTICLE_9": "Eighth, other",
      "CONTENT_9_1": "1. You need to fully understand and comply with all relevant laws, regulations and rules in your jurisdiction and the use of ONEX services.",
      "CONTENT_9_2": "2. When you use the ONEX service, if you have any questions regarding the use of personal information, you can contact us by submitting feedback on ONEX.",
      "CONTENT_9_3": "3. You can view this policy and other ONEX service rules in ONEX. We encourage you to review ONEX's service agreement and privacy policy each time you visit ONEX.",
      "CONTENT_9_4": "4. Any translated version of this policy is provided for the convenience of the user only and is not intended to modify the terms of this policy. If there is a conflict between the Chinese version and the non-Chinese version of this policy, the Chinese version shall prevail.",
      "CONTENT_9_5": "5. This policy applies from May 15, 2018.",
      "BOTTOM": "For matters not covered by this policy, you are required to comply with the announcements and relevant rules that ONIX updates from time to time."
    }
  }
}
