{
  "SUPPORT": {
    "TITLE": "ONEX Help Center",
    "BASIC": {
      "TITLE": "Basic course",
      "ARTICLE_1": "1. How to download and use ONEX safe?",
      "CONTENT_1": "To log in to the website with the domain name https://onex.cool, you can go to onex's official website and download the official onex version.",
      "CONTENT_2": "Note: It is important to note that before downloading, please make sure that the website of the official website is correct, so as not to fall into the trap of phishing websites. This is very important. ",
      "CONTENT_3": "Tip: Share a safe tip here. Manually enter the official website address https://onex.cool. If you search through Baidu, Google, or other search engine, you must also check the website. After checking the correct website, you will bookmark the official website page. You can then click on the official website next time. The folder options are entered to avoid the risk of straying into phishing websites as much as possible. ",
      "ARTICLE_1_1": "2.How to download iPhone users?",
      "CONTENT_1_1": "Open the App Store, search for ONEX, click Download, iPhone users do not use the apple ID of the unknown source, such as the Apple ID purchased from the Taobao store, and do not open the iCloud cloud backup at will; because if you use the wrong backup method, it is likely to be Synchronize to iCloud, for example, mnemonic screenshots are stored, or recorded in a memo.",
      "ARTICLE_1_2": "Android users how to download?",
      "CONTENT_1_2": "Users using the Android system can use the mobile browser to log in to the official website and click the “Android Download” button to download and install.You can also log in to the official website, download the Android application installation package on the PC, and transfer it to the mobile device installation.In addition to these two methods, you can search for \"ONEX\" download and installation in Google Play and Tencent Apps Po.Android users need to pay attention to, do not use rooted phones, and do not use deep cleanup to delete mobile files. Deep cleaning of some Android phones deletes some important files in the mobile phone.",
      "ARTICLE_2": "3. How to use ONEX transfer/receipt?",
      "CONTENT_2_1": "Enter the wallet assets interface, click on the currency of the page you want to transfer/receipt, here ETH. At the bottom there are two buttons - collect and transfer. (Figure)",
      "CONTENT_2_2": "Tip: Click the Transfer button to enter the page. In this page, you can add a contact by sweeping in the upper left corner. If necessary, you can edit the contact and add relevant notes. Then enter the transfer amount, slide the miner's fee, and click Next to complete the transfer. .Click the incoming payment button to enter the page, you can manually enter the amount of the payment. For receivables with no amount limit, the address string or two-dimensional code can be directly copied to the transfer party. This address string is different from the two-dimensional code and private key or mnemonic and can be sent to others without worrying about security issues. .",
      "ARTICLE_3": "4. How to backup wallet",
      "ARTICLE_3_1": "Graphic tutorial",
      "CONTENT_3_1": "1. Go to the Wallet Assets page, click on the \"Please backup\" font in the upper left -> click Backup mnemonics.",
      "CONTENT_3_2": "2. Enter wallet password.",
      "CONTENT_3_3": "3. To start backing up your identity, please copy the mnemonic in order.",
      "ARTICLE_4": "5. How to import mnemonics?",
      "CONTENT_4_1": "1. Go to the \"Me\" page and click \"Manage Wallet\" -> \"Import Wallet\"",
      "CONTENT_4_2": "2. Select \"Meaning\" and enter the mnemonic (space separated by each mnemonic) in the input box. Enter the wallet password and click Import Wallet."
    },
    "TRANSFER": {
      "TITLE": "Transfers/receipts",
      "ARTICLE_1": "1. The exchange's invoicing to ONEX has not arrived for a long time.",
      "CONTENT_1_1": "1). First, the exchange must be audited. First, confirm that the exchange has issued a transaction. If the exchange does not issue a transaction, let the trading platform contact the relevant person.",
      "CONTENT_1_2": "2). Then you can go to Etherscan to check if the transaction is successful https://etherscan.io (supports ERC-20 standard tokens).",
      "CONTENT_1_3": "3). Secondly, although some exchanges suggest that the transaction is successful, it only means that the exchange has sent the transaction information to the chain. Then it is necessary to wait for the miner to pack. After the miner successfully confirms the transaction, it can be deemed as successful. The exchange has been contacted to confirm that the transaction has been played, but no information on the transaction was found on Etherscan. This means that the miner has not packaged the transaction.",
      "CONTENT_1_4": "4). If you have been away from the exchange for a long time and you still cannot find any information on the transaction on Etherscan, then it is possible that this transaction has been abandoned. Please contact the exchange where the exchange is issued or The third-party platform that issued the money re-sends the transaction again.",
      "CONTENT_1_5": "5). Finally, if you have checked the transaction record on Etherscan, but it is not displayed in ONEX, then you can pull down the asset page, if the refresh is still not (token must first open a button to add assets), or Create a new wallet and try to switch wallets; if the network is slow, try switching to a mobile network.",
      "ARTICLE_2": "2. The exchange shows that the transfer BTC was successful, but the wallet did not arrive.",
      "CONTENT_2_1": "The exchange shows that the transfer success does not represent a true transfer success. In the blockchain, the transfer requires the miner to confirm the package. The user can go to blockchain.info to query the transaction. Click here to learn how to use blockchain.info.",
      "CONTENT_2_2": "Friendship reminder: Since the query of BTC's transfer is relatively complex compared to querying ETH, it is recommended that users learn how to use the blockchain to self-inquire transactions. If they are handled by customer service, it may take a relatively long time."
    },
    "SAFETY": {
      "TITLE": "Wallet security",
      "ARTICLE_1": "1. The private key has been compromised, the wallet has been stolen, can I request to freeze the account?",
      "CONTENT_1": "If you have such a situation, first of all, we express our deep sympathy. Before we ask for help, there are several situations that need to be truthfully explained to you:",
      "CONTENT_1_1": "1.ONEX is a decentralized wallet. We do not keep your private key, so we cannot implement such operations as freezing an account or rolling back a transaction.",
      "CONTENT_1_2": "2.ONEX is a decentralized wallet. We do not store user's real-name information, so we may not be able to provide evidence that is beneficial to the case.",
      "CONTENT_1_3": "3. When asking for help from us, we must truthfully explain the situation. We must not hide or evade the situation. This will not be conducive to the progress of the case. ",
      "CONTENT_1_4": "PS: If you have been stolen, please send a ticket to hack@consenlabs.com We will have someone to handle it.",
      "ARTICLE_2": "2. Anti-theft strategy",
      "CONTENT_2": "The essence of security is to prevent our private key from leaking, or being hacked to steal private keys.  ",
      "CONTENT_2_1": "Mnemonic",
      "CONTENT_2_2": "When storing mnemonics, you need to be more cautious, because once the mnemonic is stolen by a third party, your assets will face a huge threat, so it is recommended to use physical media backup, copy on a piece of paper, and keep it properly. When copying, it is necessary to pay attention to accuracy, but also pay attention to long-term preservation, do not appear problems such as handwriting is not clear.",
      "CONTENT_2_3": "PS: Users are advised to use physics media mnemonics. Do not use screenshots to store mnemonics, or store mnemonics using WeChat, QQ, email, or mobile memos.",
      "ARTICLE_3": "3. Loss prevention strategy",
      "CONTENT_3": "Lost wallet is roughly divided into three situations:",
      "CONTENT_3_1": "1). There is no backup wallet when the user deletes the wallet",
      "CONTENT_3_1_1": "We advise users to back up the wallet immediately after creating the wallet, using mnemonic backup and multiple backup strategies. Multiple backups means that after the mnemonic is backed up, verify that the backup is correct and verify it repeatedly.",
      "CONTENT_3_2": "2). Lost private key",
      "CONTENT_3_2_1": "The private key here refers to the mnemonic. Some users do not verify after copying the mnemonic, or they scramble themselves too much, which makes it difficult to identify later, which will make it impossible to find their own wallet. Therefore, we must be careful when we back up our wallets. When we are keeping wallets in the future, we must be good at using some secure management tools to ensure that we can find the private key at any time.",
      "CONTENT_3_3": "3). Backup wrong wallet",
      "CONTENT_3_3_1": "Backup wrong wallet means. The user has two wallets in ONEX, for example one is A wallet, one is B wallet, when the user wants to back up my A-wallet, I wrongly backed up my B-wallet's private key. Therefore, we recommend that after the user backs up the wallet, he must import the backup private key into the wallet and verify that the backup is correct."
    },
    "MNEMONIC": {
      "TITLE": "Mnemonic security",
      "ARTICLE_1": "1. What if I suspect my mnemonic is leaking?",
      "CONTENT_1_1": "The mnemonic is an unencrypted private key. If anyone gets your mnemonic, you can easily take control of your assets. Therefore, you must carry out asset transfer the first time you discover that the mnemonic was leaked or lost to ensure the security of the virtual property.",
      "CONTENT_1_2": "The specific steps are:",
      "CONTENT_1_3": "Create a wallet, then copy the identities of new identities on physical media (such as paper), and ensure that they are properly kept. Finally, transfer the assets to the wallet address corresponding to the new identity.",
      "ARTICLE_2": "2. After importing the mnemonic, it is found that the generated wallet address is not the same as the previous address. What is the problem?",
      "CONTENT_2": "If you import mnemonics and you discover that the generated wallet address is a new wallet address (inconsistent with the previously expected wallet address), there are three possible situations where you need to check each one.",
      "CONTENT_2_1": "Case 1: The backup mnemonic is not the address of this wallet",
      "CONTENT_2_1_1": "Because ONEX can manage multiple wallet addresses. Suppose you have two purse addresses, A and B. In the backup process, the auxiliaries of the A purse are incorrectly mapped to the purse of the B purse. When you want to import the B purse, the imported purse is the mnemonic of the A purse. The resulting address is the address of the A wallet, not the address of the B wallet that you wish to import.",
      "CONTENT_2_1_2": "Tip: You can also back up the corresponding wallet address while backing up the mnemonic, to avoid such problems.",
      "CONTENT_2_2": "Scenario 2: Missing transcripts",
      "CONTENT_2_2_1": "Another possibility is that the mnemonic is misprinted. If the transcription is wrong, there is also a very small possibility of generating a new wallet address.",
      "ARTICLE_3": "3. When importing mnemonics, why is the input prompt invalid?",
      "CONTENT_3_1": "If the prompt is invalid when you import the mnemonic into ONEX, there are several possibilities for the software to recognize the imported mnemonic:",
      "CONTENT_3_1_1": "(1) The imported mnemonic is not the correct English word, and the recorded mnemonic is incorrect or misprinted.",
      "CONTENT_3_1_2": "(2) There is a problem with the format of the words (eg, enter more spaces)",
      "CONTENT_3_2": "You can troubleshoot the problem in three ways:",
      "CONTENT_3_2_1": "(1). Check whether the mnemonic input is correct. You can check the spelling error of the word through the open specification of BIP39. https://github.com/bitcoinjs/bip39/blob/master/wordlists/english.json",
      "CONTENT_3_2_2": "(2). Please make sure that the words and words are separated by spaces. Do not separate them by Enter."
    },
    "SECURE": {
      "TITLE": "Safety Guidelines",
      "ARTICLE_1": "1. Why must backup mnemonics!",
      "CONTENT_1": "The mnemonics are convenient for users to copy backups. We recommend that users use physical media backup during backup, ie, copy mnemonic backup. This backup method can be said to have the highest security factor, completely isolated from the network, and can effectively prevent hackers from professional attacks.",
      "ARTICLE_2": "2.How to properly backup mnemonics",
      "CONTENT_2_1": " A mnemonic is a private key that is not protected by any cryptographic measures. Once someone gets your mnemonic, it is equivalent to taking control of your wallet. When using mnemonics, you need to pay attention to the following points:",
      "CONTENT_2_1_1": "a. After creating a wallet at ONEX, it is necessary to back up the mnemonic in time.",
      "CONTENT_2_1_2": "b. When backing up the mnemonic, try to use physical media backup, such as copying on a piece of paper, and then collect this piece of paper. Do not use screenshots as much as possible.",
      "CONTENT_2_1_3": "c. To ensure that the backup mnemonics are accurate, proofread the mnemonics multiple times, and use other vocabulary-supporting purses, import the mnemonics you backed up, and verify that the back-up mnemonics are correct.",
      "CONTENT_2_1_4": "d. Be sure to properly keep the mnemonics you have backed up. First, do a good job of network isolation measures. Second, prevent loss measures.",
      "ARTICLE_3": "3.What if the password is forgotten?",
      "CONTENT_3": "The only solution is to reset the new password by re-importing mnemonics."
    },
    "TOKEN": {
      "TITLE": "Token Display Problems",
      "ARTICLE_1": "1. Which tokens are supported by ONEX?",
      "CONTENT_1": "ONEX is a multi-chain wallet that supports Bitcoin, Ethereum, and other wallet types, and can quickly increase the number of tokens issued by the platform.",
      "ARTICLE_2": "2. How to add assets in one click?",
      "CONTENT_2_1": "a. Click on the \"Assets\" tab (+) icon -> Select the switch button for the asset you want to add",
      "CONTENT_2_2": "b. Return to the Assets screen to view the added assets.",
      "ARTICLE_3": "3. Why search does not seek token?",
      "CONTENT_3": "The user can use the search add token function to display the token in its own asset list. It should be noted that all the tokens in the ONEX search list are only included for the convenience of user management and the addition of tokens, and have not passed the so-called \"review\". Users should not use it as a basis for judging the quality of tokens. ",
      "ARTICLE_4": "4. How is the transfer timeout?",
      "CONTENT_4": "It may be caused by the out of sync between the ONEX and the block. The time out of the transfer does not mean that the transfer failed. For details of the transaction, please go to Etherscan (https://etherscan.io/).",
      "ARTICLE_5": "5. Show transfer failed but deducted miner's fee.",
      "CONTENT_5_1": "As long as the transaction is packaged by the miner, it will consume gas, but due to failed packaging, or block verification failed(Insufficient Gas charges, calls to wrong contract methods, etc.) will result in miner's fees being consumed, as well as reversal of the reversal amount.",
      "CONTENT_5_2": "PS: The miner's fee is charged by the miner, and ONEX does not currently charge a transfer fee."
    },
    "BCKNOW": {
      "TITLE": "Blockchain knowledge",
      "ARTICLE_1": "1. The miner's fee on Ethereum (gas)",
      "CONTENT_1_1": "The origin of the miner's fee",
      "CONTENT_1_1_1": "On a public chain, anyone can read and write data. Reading data is free, but there is a cost to write data to the public chain. This overhead helps to stop spam and protects its security through payments. Any node on the network (each connection device containing a copy of the account is called a node) can participate in the protection of the network by means known as mining. Because mining requires computing power and electricity, the miners' services need to be compensated. This is also the reason for the miner's fees.",
      "CONTENT_1_2": "What is gas",
      "CONTENT_1_2_1": "The difference between Ethereum and Bitcoin, Ethereum introduced the concept of gas. The purpose of gas is to limit the amount of work required to perform a transaction and pay for the execution. The gas is used to measure the resources (including calculations, storage, bandwidth, etc.) consumed by your transaction (or contract code call). The transfer fee generated by a transaction will be awarded to miners who package the block containing the transaction. The block is not generated by which miner. All miners will compete for the right to pack the next block. The winner can pack the next block. A transaction does not necessarily have a block. After the transaction is broadcast, all nodes in the entire network will receive the transaction within a few seconds. The miners preferentially package gas with reasonable gas prices. If the miner's fee paid during the transaction is out of gas, the transaction may not be packaged by the miner, causing the transaction to fail.",
      "CONTENT_1_2_2": "Ethereum's transaction costs = gas quantity * gas price (gas unit price, in euros)",
      "ARTICLE_2": "2. What is a smart contract",
      "CONTENT_2_1": "The smart contract is the idea proposed by Nick Saab in the 1990s: \"A smart contract is a set of agreements defined in a digital form, including agreements on which contract participants can execute these agreements.\"",
      "CONTENT_2_2": "However, because of the lack of a reliable execution environment, smart contracts have not been applied to the actual industry. Since the birth of Bitcoin, people have realized that Bitcoin's underlying technology blockchain can provide a trusted execution environment for smart contracts. The workshop first saw the fit of blockchain and smart contracts, and released the whitepaper Ethereum: The Next Generation Smart Contracts and Decentralization Application Platform. It has been working hard to make Ethereum the best smart contract platform, so Bitcoin Leading the blockchain, Ethereum revives smart contracts.",
      "CONTENT_2_3": "A smart contract program is not just a computer program that can be executed automatically: it is itself a system participant. It responds to the information it receives. It can receive and store value, and it can also send out information and value. This program is like a person who can be trusted, can temporarily keep assets, and always follow the rules in advance.",
      "CONTENT_2_4": "Smart contract model: It is a computer program running on a copyable, shared account book that can process information, receive, store, and send value.",
      "CONTENT_2_5": "The following is a simple smart contract for financial applications:",
      "CONTENT_2_5_1": "Suppose Alice wants to make sure her money is safe, but she fears losing or being hacked to steal her private key. She put Ethereum in a contract with Bob. As follows, this contract is a bank:",
      "CONTENT_2_5_2": "Alice can withdraw up to 1% of funds on a daily basis.",
      "CONTENT_2_5_3": "Bob can extract up to 1% of funds each day, but Alice can use her private key to create a transaction to cancel Bob's withdrawal rights.",
      "CONTENT_2_5_4": "Alice and Bob can withdraw funds arbitrarily.",
      "CONTENT_2_5_5": "In general, 1% per day is enough for Alice. If Alice wants to withdraw more, she can contact Bob for help. If Alice's private key is stolen, she can immediately find Bob to transfer her funds to a new contract. If she loses her private key, Bob can slowly raise the money. If Bob shows malice, she can turn off his withdrawal rights.",
      "ARTICLE_3": "3. What is Ethereum",
      "CONTENT_3_1": "Ethereum is an open source public blockchain platform with smart contract functionality. Decentralized virtual machines (called Ethereum Virtual Machines) are used to process point-to-point contracts through its private cryptocurrency Ether (Ether, also known as \"Ether\"). The concept of Ethereum was first inspired by Bitital in 2013-2014 by programmer Vitalik Buterin. It was proposed as \"the next generation cryptocurrency and decentralized application platform\". In 2014, it began to develop through ICO crowdfunding.",
      "CONTENT_3_2": "Ethereum is not only a database, it also allows you to run programs in the trusted environment of the blockchain. Ethereum built a virtual machine named EVM (Ethereum Virtual Machine) on the blockchain. The EVM allows verification and execution of code on the blockchain, providing security for the code to run in the same way on everyone's machine. These codes are included in smart contracts. In addition to tracking the balance of the account, Ethereum uses the same method to save the state of the EVM on the blockchain. All nodes handle smart contracts to verify the integrity of the contract itself and its output."
    },
    "BC": {
      "TITLE": "Blockchain",
      "ARTICLE_1": "1 basic blockchain characteristics",
      "CONTENT_1": "Blockchains are decentralized, irreversible, irreversible, and anonymous.",
      "CONTENT_1_1": "Decentralization: Because the entire network has no central ruler. The system relies on the fairness constraint of multiple participants on the network, so the rights and obligations of any one or several nodes are equal, and each node will store all the data in this blockchain. Even if the node is damaged or attacked, it will not cause any threat to the books.",
      "CONTENT_1_2": "Cannot be tampered with: Make sure the information or contract cannot be forged. Account books are very likely to be fraudulent in the hands of a person or persons, but each person has a book in his hands, unless more than 51% of the entire game changes a certain account, or any tampering is Ineffective, this is also the superiority of collective maintenance and supervision.",
      "CONTENT_1_3": "Irreversible: The information in the blockchain must be irrevocable and cannot be destroyed at will. The system is open source, and the entire system must be open and transparent. Therefore, after a transaction is broadcast on the entire network, reaching six confirmations or more will be recorded successfully, and it will be irreversible. Note: ONEX is confirmed by 12 blocks.",
      "CONTENT_1_4": "Anonymity: The identity information of each block node does not need to be announced or verified, and information transfer can be performed anonymously. A simple example is that you initiate a transaction to a wallet address on the blockchain, but you can't know exactly which one is behind the address, or your private key was stolen by a hacker and you can't get from one In the wallet address, you know who the hackers are.",
      "ARTICLE_2": "2. What is a mnemonic?",
      "CONTENT_2_1": "The mnemonic is another expression of the plaintext private key, first proposed by the BIP39 proposal. Its purpose is to help users memorize complex private keys. The mnemonics are usually composed of 12, 15, 18, and 21 words. These words are taken from a fixed vocabulary. The generation order is also based on a certain algorithm. Therefore, the user does not need to worry about inputting 12 words randomly to generate a word. address. Anyone who gets your mnemonic can take away your assets without effort. Therefore, after the user has backed up the mnemonic, he must pay attention to three points:",
      "CONTENT_2_1_1": "1) Use physical media as much as possible to back up, for example, using a pen to copy on paper, etc. Do not use screen captures or pictures after placing on networked devices as much as possible to prevent them being stolen by hackers.",
      "CONTENT_2_1_2": "2) Verify that the mnemonics of the backup are correct and correct. If one or two words are misspelled, it will bring great difficulties to recover the correct mnemonics.",
      "CONTENT_2_1_3": "3) Keep the back-up mnemonics properly and do the anti-theft measures.",
      "CONTENT_2_2": "PS: Users can use the backup mnemonics to re-import ONEX, in this way to modify the corresponding wallet password."
    },
    "BTC": {
      "TITLE": "Bitcoin",
      "ARTICLE_1": "1. What is BTC",
      "CONTENT_1_1": "The concept of Bitcoin was first proposed by Nakamoto in 2009, and according to the idea of Nakamoto, it designed open source software and built a P2P network on it. Bitcoin is a P2P digital currency. Point-to-point transmission means a decentralized payment system.",
      "CONTENT_1_2": "Bitcoin does not rely on specific institutions for distribution. It generates a large number of calculations based on specific algorithms. Bitcoin uses a distributed database of multiple nodes in the entire P2P network to identify and record all transactional behaviors, and uses cryptographic design to ensure All aspects of security. The decentralized nature of P2P and the algorithm itself can ensure that human currency can't be manipulated through the massive manufacturing of Bitcoin. The cryptographic design allows bitcoin to be transferred or paid only by the real owner. This also ensures the security of bitcoin ownership and circulation transactions. The limited number of Bitcoin is permanently limited to 21 million.",
      "ARTICLE_2": "2. Bitcoin mining and miners' fees",
      "CONTENT_2_1": "Bitcoin mining is a process of increasing Bitcoin's supply. Mining also protects the security of the Bitcoin system, prevents fraudulent transactions, and avoids \"double payments,\" which means spending the same bitcoin multiple times. Miners can exchange for the bitcoin network in exchange for access to Bitcoin rewards.",
      "CONTENT_2_2": "The miners will receive two types of rewards during the mining process: the creation of a new block of SGD rewards, and transaction fees for the transactions contained in the block. In order to get these rewards, the miners competed to complete a mathematical puzzle based on a cryptographic hash algorithm. The answers to these puzzles were included in the new block. As proof of the miner’s computational workload, the miners were called \"workload proof\". The competition mechanism of the algorithm and the mechanism for the winner to have the transaction records on the blockchain are the cornerstones of bitcoin cybersecurity.",
      "CONTENT_2_3": "Miners also receive transaction fees. Each transaction may include a transaction fee, which is the difference between the input and output of each transaction record. The miners who \"dig\" the new block during the mining process can get all the trade \"tips\" contained in the block. ",
      "ARTICLE_3": "3. Bitcoin's key, address and wallet",
      "CONTENT_3_1": "Bitcoin's ownership is established through digital keys, bitcoin addresses, and digital signatures. The digital key is not actually stored in the network, but is generated by the user and stored in a file or a simple database called a wallet. The digital key stored in the user's wallet is completely independent of the Bitcoin protocol and can be generated and managed by the user's wallet software without blockchain or network connections. The key implements many of the interesting features of Bitcoin, including decentralized trust and mechanisms, ownership authentication, and cryptographic-based security models.",
      "CONTENT_3_2": "Every bitcoin transaction requires a valid signature to be stored in the blockchain. Only a valid digital key can produce a valid digital signature, so having a Bitcoin copy of the key is equivalent to having control of the account's Bitcoin. A Bitcoin wallet contains a series of key pairs. Each key pair contains a private key and a public key. The public key is like a bank account. The private key is like the PIN of the control account or the signature of the check. Bitcoin users rarely see digital keys directly. In general, they are stored in wallet files and managed by the Bitcoin wallet software.",
      "CONTENT_3_2_1": "1) What is a BTC private key?",
      "CONTENT_3_2_2": "The private key is a number, usually chosen randomly. The control of all funds in a Bitcoin address depends on the ownership and control of the corresponding private key. In Bitcoin transactions, the private key is used to generate the signature necessary to pay for Bitcoin to prove the ownership of the funds. The private key must always be kept secret, because once leaked to a third party, Bitcoin, which is equivalent to the protection of the private key, is surrendered. The private key must also be backed up to prevent accidental loss because the private key is difficult to recover once it is lost, and the bitcoin it protects will also disappear forever.",
      "CONTENT_3_2_3": "2) What is the BTC address?",
      "CONTENT_3_2_4": "With the private key, we can generate a public key using the elliptic curve multiplication, a one-way encryption function, which is an irreversible process. With the public key, we can use a one-way cryptographic hash function to generate a bitcoin address.",
      "CONTENT_3_2_5": "In general, Bitcoin addresses are generated by a public key and correspond to this public key. The Bitcoin address is like the name of the payment object on the check (ie, the \"payee\"). This way, the Bitcoin address abstracts the payee, making the transaction's destination more flexible, just like a check. Bitcoin addresses are the only representatives of keys that users often see, and they only need to tell others about their Bitcoin address. ",
      "CONTENT_3_2_6": "3) What is a wallet?",
      "CONTENT_3_2_7": "The wallet is a container for private keys, usually implemented as an ordered file or a simple database. Bitcoin wallet only contains the private key instead of Bitcoin. Each user has a wallet with multiple private keys. The wallet contains pairs of private and public keys. Users use these private keys to sign transactions, which proves that they have the output of the transaction (that is, the bitcoin therein). Bitcoin is stored in the blockchain in the form of transaction output."
    }
  }
}
